[
  {
    "image": "https://images.unsplash.com/photo-1603791440384-56cd371ee9a7?w=800&h=800&fit=crop",
    "title": "TaskFlow Pro Manager",
    "companyName": "Skybase Technologies",
    "id": 1,
    "description": "TaskFlow Pro Manager is the ultimate solution for organizing your daily routines and long-term goals. It helps you break down complex tasks into simple, trackable milestones. AI-driven suggestions adapt to your habits to keep productivity high. You can prioritize, categorize, and color-code tasks for better visualization. Real-time reminders ensure you never miss a deadline again. Collaborate with others on shared projects and stay updated with smart notifications. The analytics dashboard highlights productivity patterns to help you improve focus. With seamless sync across devices and cloud backup, your workflow remains consistent and secure. TaskFlow turns your to-do list into an intelligent productivity partner designed to help you achieve more, every single day.",
    "size": 85,
    "reviews": 1200,
    "ratingAvg": 4.5,
    "downloads": 350000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 580 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1509395176047-4a66953fd231?w=800&h=800&fit=crop",
    "title": "FitSync Health Tracker",
    "companyName": "NovaWell",
    "id": 2,
    "description": "FitSync Health Tracker brings all your fitness data together into one intelligent dashboard. It tracks workouts, heart rate, sleep, and nutrition with precise analytics. You can set personalized goals and get AI-powered insights to improve results. The app syncs instantly with your smartwatch and fitness bands for real-time monitoring. Get weekly progress summaries and motivational challenges with friends. FitSync also provides guided workouts and adaptive meal plans designed for your lifestyle. With voice assistance, tracking becomes effortless even during intense sessions. Its beautiful design and seamless cloud sync make it the perfect wellness companion. Whether you’re a beginner or an athlete, FitSync keeps you on the right track toward a healthier life.",
    "size": 92,
    "reviews": 980,
    "ratingAvg": 4.2,
    "downloads": 280000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 430 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1607082349566-187342175e2f?w=800&h=800&fit=crop",
    "title": "PhotoCraft AI Studio",
    "companyName": "PixelMinds",
    "id": 3,
    "description": "PhotoCraft AI Studio gives creators the tools to transform any photo into a masterpiece. Its advanced AI automatically enhances color, lighting, and sharpness with remarkable accuracy. You can remove unwanted objects or change backgrounds in one tap. The app supports both casual edits and professional-grade retouching with multi-layer control. Smart filters and style presets allow quick artistic transformations. Batch editing lets photographers handle entire albums effortlessly. Cloud saving ensures your projects are safe and accessible anywhere. From social media creators to professional designers, PhotoCraft combines simplicity with powerful precision. It’s the go-to editing suite for those who want to turn ordinary images into extraordinary visuals.",
    "size": 104,
    "reviews": 1500,
    "ratingAvg": 4.8,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 1010 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1563986768609-322da13575f3?w=800&h=800&fit=crop",
    "title": "SecureVault Data Locker",
    "companyName": "FortiTech Labs",
    "id": 4,
    "description": "SecureVault Data Locker ensures your sensitive information stays private and protected. It uses next-generation encryption to safeguard passwords, files, and personal documents. The zero-knowledge architecture means only you have access to your data. With biometric authentication, you can unlock your vault securely and instantly. Auto-fill credentials safely on websites without risking breaches. Organize multiple accounts and notes with intuitive folders. The dark-mode interface offers both aesthetics and security focus. Real-time breach alerts notify you of any compromised accounts. Whether for personal or corporate use, SecureVault is your trusted digital fortress for maximum data security and peace of mind.",
    "size": 78,
    "reviews": 2100,
    "ratingAvg": 4.7,
    "downloads": 620000,
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 1305 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1498050108023-c5249f4df085?w=800&h=800&fit=crop",
    "title": "CodeSphere Cloud IDE",
    "companyName": "DevX Studio",
    "id": 5,
    "description": "CodeSphere Cloud IDE gives developers the freedom to code from anywhere with full control. Supporting over 40 programming languages, it combines performance, portability, and AI-powered assistance. Auto-completion and smart debugging tools boost efficiency while reducing errors. You can collaborate with teammates in real time on shared projects. Built-in terminals, version control, and cloud deployment make it a complete development environment. No installation needed — everything runs in your browser. The dark theme and customizable layout enhance focus during long coding sessions. CodeSphere turns every device into a powerful workstation and every coder into a creator without limits.",
    "size": 110,
    "reviews": 3100,
    "ratingAvg": 4.6,
    "downloads": 900000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 2060 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1545235617-9465d2a55698?w=800&h=800&fit=crop",
    "title": "NoteEdge Smart Notes",
    "companyName": "Thinkly Apps",
    "id": 6,
    "description": "NoteEdge Smart Notes transforms the way you capture, organize, and recall information. It blends handwriting, text, and multimedia inputs into a unified experience. You can record lectures, add sketches, and attach documents in one place. AI tagging and instant search make finding notes effortless. The app supports cloud sync so your ideas follow you everywhere. With offline access, you can work without interruptions. Custom themes and folders allow personal organization. Smart reminders keep you on top of deadlines and daily goals. Whether you’re a student, writer, or professional, NoteEdge keeps your thoughts structured and always accessible.",
    "size": 68,
    "reviews": 1250,
    "ratingAvg": 4.4,
    "downloads": 400000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 530 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1556157382-97eda2d62296?w=800&h=800&fit=crop",
    "title": "FinancePilot Expense Tracker",
    "companyName": "AurumSoft",
    "id": 7,
    "description": "FinancePilot Expense Tracker helps you understand your finances with precision and clarity. It tracks income, expenses, investments, and savings effortlessly. The AI categorization engine automatically organizes transactions into meaningful charts. You can set budgets, receive alerts, and analyze trends over time. The app supports currency conversion and financial goal tracking for global users. Cloud backup ensures your data remains safe and recoverable. Built-in tips guide you toward better money habits. With easy report export for tax or audit purposes, FinancePilot is the ultimate tool for financial freedom. Take charge of your money and make smarter financial decisions with every tap.",
    "size": 88,
    "reviews": 890,
    "ratingAvg": 4.3,
    "downloads": 250000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 140 },
      { "name": "4 star", "count": 320 },
      { "name": "5 star", "count": 345 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?w=800&h=800&fit=crop",
    "title": "TeamHub Work Connect",
    "companyName": "OrbitSoft",
    "id": 8,
    "description": "TeamHub Work Connect brings teams closer through intelligent collaboration tools. It combines chat, video calls, and project boards into one seamless platform. The customizable workspace ensures every team finds its rhythm. Task tracking and progress reports keep everyone accountable and aligned. You can share files securely and co-edit documents in real time. Integration with cloud services like Google Drive and Slack boosts productivity. Built with privacy in mind, all data is end-to-end encrypted. The intuitive interface reduces clutter and keeps communication clear. TeamHub transforms teamwork into a smooth, connected experience that drives results.",
    "size": 96,
    "reviews": 2000,
    "ratingAvg": 4.5,
    "downloads": 540000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 960 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=800&h=800&fit=crop",
    "title": "EduMind Smart Learn",
    "companyName": "SmartLearn Labs",
    "id": 9,
    "description": "EduMind Smart Learn revolutionizes education with AI-powered personalization. The platform adapts courses based on your strengths and weaknesses. Interactive quizzes and flashcards make studying more engaging. Smart reminders help maintain consistency in your learning schedule. Teachers can assign lessons, monitor progress, and provide instant feedback. The app supports offline access and automatic progress sync. AI-generated study summaries enhance quick revisions before exams. A vibrant community of learners enables peer discussions and shared projects. Whether mastering academics or professional skills, EduMind makes learning smarter, faster, and infinitely more effective.",
    "size": 130,
    "reviews": 1750,
    "ratingAvg": 4.6,
    "downloads": 600000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 930 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1593642532973-d31b6557fa68?w=800&h=800&fit=crop",
    "title": "Streamify Media Hub",
    "companyName": "VisionCast",
    "id": 10,
    "description": "Streamify Media Hub curates the world of entertainment into one stunning experience. Discover trending movies, exclusive shows, and curated playlists based on your preferences. Its AI recommendation engine learns your taste over time. Enjoy adaptive streaming that maintains HD quality even on slower connections. The elegant interface offers quick navigation and minimal ads. Multi-device sync lets you start watching on one device and finish on another. Parental controls ensure a safe experience for families. Offline mode allows downloads for travel or low-network areas. Streamify isn’t just a streaming app — it’s your personalized cinematic universe.",
    "size": 118,
    "reviews": 2700,
    "ratingAvg": 4.7,
    "downloads": 800000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 240 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1650 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1629909613654-28e377c37b09?w=800&h=800&fit=crop",
    "title": "DocuMate Cloud Sign",
    "companyName": "CloudVerse",
    "id": 11,
    "description": "DocuMate Cloud Sign simplifies document management for professionals and teams. Securely upload, store, and share files across devices. Built-in e-signature functionality allows legally valid signatures within seconds. The app integrates seamlessly with cloud platforms like Google Drive and Dropbox. Version control ensures you never lose important updates. Role-based access lets you manage permissions for collaborators. Military-grade encryption guarantees data safety at every step. Real-time notifications keep you updated on document activity. Whether for contracts, reports, or personal records, DocuMate ensures document workflows are faster, safer, and more reliable than ever.",
    "size": 75,
    "reviews": 1100,
    "ratingAvg": 4.5,
    "downloads": 300000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 380 },
      { "name": "5 star", "count": 535 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e?w=800&h=800&fit=crop",
    "title": "Travelio Trip Planner",
    "companyName": "Voyage Labs",
    "id": 12,
    "description": "Travelio Trip Planner turns travel planning into an effortless adventure. Discover destinations, compare flights, and book hotels — all within one app. The AI itinerary generator curates daily schedules based on your preferences. Real-time weather, transport, and map integrations enhance your journey. You can track bookings and receive flight alerts automatically. Offline maps help you navigate even without the internet. The travel journal feature allows documenting memories with photos and notes. Budget tools ensure you stay on track financially. Whether it’s a weekend getaway or a world tour, Travelio makes every trip smarter and smoother.",
    "size": 90,
    "reviews": 1700,
    "ratingAvg": 4.4,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 880 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1504384308090-c894fdcc538d?w=800&h=800&fit=crop",
    "title": "SoundWave Audio Studio",
    "companyName": "EchoVerse",
    "id": 13,
    "description": "SoundWave Audio Studio brings professional sound editing to your fingertips. Record, mix, and master audio with studio-grade precision. The real-time waveform editor offers control over every beat. Smart noise reduction and auto-leveling enhance recordings automatically. You can create podcasts, music tracks, or voice-overs easily. Multi-track layering allows advanced editing without complexity. Export in multiple audio formats for seamless sharing. Built-in effects, equalizers, and presets deliver professional quality every time. Whether you’re an artist, podcaster, or audio engineer, SoundWave turns your device into a complete production studio.",
    "size": 65,
    "reviews": 950,
    "ratingAvg": 4.1,
    "downloads": 220000,
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 345 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1526256262350-7da7584cf5eb?w=800&h=800&fit=crop",
    "title": "GameVerse Gaming Zone",
    "companyName": "PlayNexus",
    "id": 14,
    "description": "GameVerse Gaming Zone gathers the hottest games in one exciting hub. Discover, download, and play trending titles from around the world. Its intelligent recommendation engine suggests games based on your interests. Participate in live tournaments and earn digital rewards. The social gaming feed connects you with fellow gamers globally. You can stream gameplay directly from the app with built-in recording tools. Daily challenges and leaderboards keep competition alive. Parental control and data limits ensure safe use for all ages. GameVerse is the next-generation gaming universe where fun meets innovation.",
    "size": 140,
    "reviews": 2400,
    "ratingAvg": 4.8,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 620 },
      { "name": "5 star", "count": 1475 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1485217988980-11786ced9454?w=800&h=800&fit=crop",
    "title": "MindEase Meditation App",
    "companyName": "Calmiq Studio",
    "id": 15,
    "description": "MindEase Meditation App helps you cultivate calm, focus, and balance through guided mindfulness practices. Explore hundreds of meditation sessions for sleep, stress, and concentration. Breathing exercises are personalized to your current mood and heart rate. The minimal design encourages relaxation without distraction. Daily reminders help you maintain consistency in your mindfulness journey. Sleep stories and ambient sounds create a soothing bedtime experience. Offline access ensures peace even without connectivity. Progress tracking and mood journaling foster deeper self-awareness. MindEase is your digital sanctuary for mental wellness and emotional clarity.",
    "size": 70,
    "reviews": 1850,
    "ratingAvg": 4.6,
    "downloads": 450000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 65 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 1035 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1522199710521-72d69614c702?w=800&h=800&fit=crop",
    "title": "Cookify Recipe World",
    "companyName": "Kitchenly",
    "id": 16,
    "description": "Cookify Recipe World is every food lover’s dream app. Discover thousands of recipes from around the globe with step-by-step guidance. The smart ingredient matcher suggests dishes based on what’s already in your kitchen. You can customize servings, cooking time, and dietary filters easily. HD tutorial videos ensure even beginners can cook like pros. Meal planning and grocery list features simplify your week. Save and share favorite recipes with your friends. Voice-guided mode makes hands-free cooking possible. With daily updates and seasonal collections, Cookify makes cooking joyful, simple, and endlessly creative.",
    "size": 98,
    "reviews": 1600,
    "ratingAvg": 4.7,
    "downloads": 370000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 45 },
      { "name": "3 star", "count": 130 },
      { "name": "4 star", "count": 410 },
      { "name": "5 star", "count": 990 }
    ]
  }
]
